// Load required packages
var mongoose = require('mongoose');

// Define our schema
var ScriptSchema   = new mongoose.Schema({
    greetings: {type: String},
    offer: {type: String},
    demo: {type: String},
    vite: {type: String},
    goodtime: {type: String},
    time: {type: String},
    appointment: {type: String},
    outro: {type: String},
    getlost: {type: String},
    //«ДОСТАЛИ!!!»
    //--------------------------------------
    think: {type: String},
    //«Мне нужно подумать»
    //--------------------------------------
    notime: {type: String},
    //НЕТ ВРЕМЕНИ
    //--------------------------------------
    closed_date: {type: String},
    //Я не могу в четверг, могу в воскресенье(закрытая дата)
    //--------------------------------------
    company: {type: String},
    //Сколько существует Ваша компания?
    //--------------------------------------
    cosmetics : {type: String},
    //Какой косметикой Вы работаете?
    //--------------------------------------
    manufacture: {type: String},
    //Кто производитель этого продукта?
    //--------------------------------------
    duration: {type: String},
    //Сколько по времени займет посещение?
    //--------------------------------------
    reviews: {type: String},
    //ОТЗЫВЫ
    //--------------------------------------
    where_number: {type: String},
    //Откуда у вас мой номер телефона?
    //--------------------------------------
    need_take: {type: String},
    //С собой необходимо что-то брать?
    //--------------------------------------
    cost: {type: String},
    //Сколько стоит ваша косметика?
    //--------------------------------------
    alergy: {type: String},
    //Вызывает ли аллергию Ваша косметика?
    //--------------------------------------
    hormone: {type: String},
    //Гормональная ли косметика?
    //--------------------------------------
    tested: {type: String},
    //На ком тестировалась косметика?
    //--------------------------------------
    herpes: {type: String},
    //ГЕРПЕС
    //--------------------------------------
    time: {type: String},
    //Сколько по времени займет посещение?
    //--------------------------------------
    free: {type: String},
    //Это бесплатно?
    //--------------------------------------
    selfcall: {type: String},
    //Я сама вам перезвоню.
    //--------------------------------------
    onmyown: {type: String},
    //Я приду сама!
    //--------------------------------------
    passport: {type: String},
    //ЗАЧЕМ ВАМ ПАСПОРТ?
    //--------------------------------------
    notInterested: {type: String},
    //НЕ ИНТЕРЕСУЕТ
    //--------------------------------------
    //примечание от автора, я заебался пока писал эту схему!!!
}, { strict: false });

// Export the Mongoose model
module.exports = mongoose.model('Script', ScriptSchema);